Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectFrame Constructor
Overload List
Name | Description
EmbeddedObjectFrame(LineTypes, DrawingColors)
 Creates a new embedded object frame instance with the specified line type and color.
EmbeddedObjectFrame(LineTypes, TeklaDrawingColor)
 Creates a new embedded object frame instance with the specified line type and user defined RGB color.
Top
See Also
Reference
EmbeddedObjectFrame Class
Tekla.Structures.Drawing Namespace